       01  Tst-Record.
           03 Field-Right-Justified     Pic x(20) justified Right.
           03 Field-Justified           Pic x(20) justified.
           03 Field-1                   Pic X(20).