       01 Detail-Record-A.
          05 Record-Type                            Pic X.
             88 Detail-Record         value 'A'.
          05 Field-1a                                Pic X(11).
          05 Field-2a                                Pic X(12).
          05 Field-3a                                Pic X(11).
          05 Field-4a                                Pic X(44).
          