05 MESC1601.
07 MESC1601-SERVICE-ADDRESS-INFO.
10 MESC1601-ADDRESS.
15 MESC1601-HOUSE	PIC X(10).
15 MESC1601-HOUSE-SUFFIX	PIC X(04).
15 MESC1601-STREET	PIC X(48).
15 MESC1601-STREET-SUFFIX	PIC X(04).
15 MESC1601-PRE-DIRECTIONAL-CODE	PIC X(02).
15 MESC1601-POST-DIRECTIONAL-CODE	PIC X(02).
15 MESC1601-LOCATION	PIC X(20).
15 MESC1601-COMMUNITY	PIC X(20).
15 MESC1601-PROV-STATE	PIC X(02).
10 MESC1601-SACH-COMMUNITY	PIC X(32).
10 MESC1601-TAX-PROV-STATE	PIC X(02).
10 MESC1601-TAX-JURISDICTION-ID	PIC X(04).
10 MESC1601-CENTRAL-OFFICE	PIC X(08).
10 MESC1601-COUNTY-NAME	PIC X(32).
10 MESC1601-SACH-REMARKS	PIC X(73).
07 MESC1601-PHONE-INFO.
10 MESC1601-OLD-PHONE-NUMBER.
15 MESC1601-OLD-NPA	PIC X(03).
15 MESC1601-OLD-NXX	PIC X(03).
15 MESC1601-OLD-DIRECTORY	PIC X(04).
10 MESC1601-NEW-PHONE-NUMBER.
15 MESC1601-NEW-NPA	PIC X(03).
15 MESC1601-NEW-NXX	PIC X(03).
15 MESC1601-NEW-DIRECTORY	PIC X(04).
10 MESC1601-OLD-USOC	PIC X(06).
10 MESC1601-NEW-USOC	PIC X(06).
10 MESC1601-OLD-USOC2	PIC X(06).
10 MESC1601-NEW-USOC2	PIC X(06).
10 MESC1601-OLD-NP-IND	PIC X(01).
10 MESC1601-NEW-NP-IND	PIC X(01).
10 MESC1601-OLD-RES-BUS-IND	PIC X(01).
10 MESC1601-NEW-RES-BUS-IND	PIC X(01).
10 MESC1601-OPX-IND	PIC X(01).
07 MESC1601-CUSTOMER-INFO.
10 MESC1601-OLD-NAME.
15 MESC1601-OLD-LAST-NAME	PIC X(25).
15 MESC1601-OLD-FIRST-NAME	PIC X(20).
15 MESC1601-OLD-MIDDLE-NAME	PIC X(10).
15 MESC1601-OLD-TITLE	PIC X(05).
10 MESC1601-OLD-NAME-FORMAT-TYPE	PIC X(01).
88 MESC1601-OLD-RES-FORMAT VALUE 'R'.
88 MESC1601-OLD-BUS-FORMAT VALUE 'B'.
10 MESC1601-NEW-NAME.
15 MESC1601-NEW-LAST-NAME	PIC X(25).
15 MESC1601-NEW-FIRST-NAME	PIC X(20).
15 MESC1601-NEW-MIDDLE-NAME	PIC X(10).
15 MESC1601-NEW-TITLE	PIC X(05).
10 MESC1601-NEW-NAME-FORMAT-TYPE	PIC X(01).
88 MESC1601-NEW-RES-FORMAT VALUE 'R'.
88 MESC1601-NEW-BUS-FORMAT VALUE 'B'.
07 MESC1601-TRANSACTION-INFO.
10 MESC1601-SO-TYPE	PIC X(06).
10 MESC1601-SO-NUMBER	PIC X(10).
10 MESC1601-SR-NUMBER	PIC 9(07).
10 MESC1601-LCI-NUMBER	PIC 9(04).
10 MESC1601-SO-ACTION-IND	PIC X(01).
88 MESC1601-ASSIGNMENT VALUE 'A'.
88 MESC1601-DISCONNECT VALUE 'D'.
88 MESC1601-CHANGE VALUE 'C'.
10 MESC1601-USER-ID	PIC X(08).