       01  CompFields.
           03 NumA         pic --,---,---,---,---,--9.99.
           03 sep0         pic x.
           03 Num0         pic s99 comp sync.
           03 sep1         pic x.
           03 Num1         pic s9v99  comp sync.
           03 sep2         pic x.
           03 Num2         pic s9(02)v99 comp sync.
           03 sep3         pic x.
           03 Num3         pic s9(03)v99 comp sync.
           03 sep4         pic x.
           03 Num4         pic s9(04)v99 comp sync.
           03 sep5         pic x.
           03 Num5         pic s9(05)v99 comp sync.
           03 sep6         pic x.
           03 Num6         pic s9(06)v99 comp sync.
           03 sep7         pic x.
           03 Num7         pic s9(07)v99 comp sync.
           03 sep8         pic x.
           03 Num8         pic s9(08)v99 comp sync.
           03 sep9         pic x.
           03 Num9         pic s9(09)v99 comp sync.
           03 sep10        pic x.
           03 Num10        pic s9(10)v99 comp sync.
           03 sep11        pic x.
           03 Num11        pic s9(11)v99 comp sync.
           03 sep12        pic x.
           03 Num12        pic s9(12)v99 comp sync.
           03 sep13        pic x.
           03 Num13        pic s9(13)v99 comp sync.
           03 sep14        pic x.
           03 Num14        pic s9(14)v99 comp sync.
           03 sep15        pic x.
           03 Num15        pic s9(15)v99 comp sync.
           03 sep16        pic x.
           03 Num16        pic s9(16)v99 comp sync.
          
           03 sep17        pic x.
           03 Num17        pic 9(05)v99 comp sync.

