       01  record-1.
           03 record-type                       pic x.
           03 field11                           pic s9(5).
           03 field12                           pic x(10).
           03 field13                           pic x(15).
           
       01  record-2.
           03 record-type                       pic x.
           03 field21                           pic x(8).
           03 field22                           pic x(10).
           03 field23                           pic x(12).           