000100*                                                                         
000400*                                                                                                                          
000800*                                                                         
001500        03  DTAR022-SALE-PRICE         PIC S9(9)V99.               
001400        03  DTAR022-QTY-SOLD           PIC S9(9).               
001300        03  DTAR022-DEPT-NO            PIC 9(03).               
001200        03  DTAR022-DATE               PIC 9(07).               
000900        03  DTAR022-KCODE-STORE-KEY.                                      
001100            05 DTAR022-STORE-NO        PIC 9(03).               
001000            05 DTAR022-KEYCODE-NO      PIC X(08).                         

