       01 Detail-Record-B.
          05 Record-Type                            Pic X.
             88 Detail-Record         value 'B'.
          05 Field-1b                                Pic X(22).
          05 Field-2b                                Pic X(33).
          05 Field-3b                                Pic X(11).
          05 Field-4b                                Pic X(11).
 
