       01 Location-Record.
           03 Record-Type            pic xx.
           03 location occurs 10.
              05 DC-Number           pic 9(4).
              05 Pack-Quantity       pic 9(8).         
