       01 PO-Record.   
           03 Record-Type            Pic X(2).
           03 Sequence-Number        Pic 99v999. 
           03 Vendor                 Pic 9(10).  
           03 PO                     Pic 9(12).  
           03 Entry-Date             Pic X(6).
           03 Filler                 Pic X(8).
           03 beg01-code             Pic X(2).
           03 beg02-code             Pic X(2).
           03 Department             Pic X(4).
           03 Expected-Reciept-Date  Pic X(6).
           03 Cancel-by-date         Pic X(6).
           03 Filler                 Pic X(4).
           03 EDI-Type               Pic X(1).
           03 Add-Date               Pic X(6).
           03 Filler                 Pic X(1).
           03 Department-Name        Pic X(10).
           03 Prcoess-Type           Pic X(1).
           03 Order-Type             Pic X(2).
