        01 Product-Record.
           03 Record-Type            pic xx.
           03 Pack-Qty               Pic 9(5)V9999.
           03 Pack-Cost              Pic 9(9)V9999.
           03 APN                    Pic 9(13).                                           .
           03 Filler                 Pic X(1).
           03 Product                Pic 9(8).
           03 Filler                 Pic X(25).
           03 pmg-dtl-tech-key       Pic X(15).
           03 Case-Pack-id           Pic X(15).
           03 Product-Name           Pic X(50).
