      ******************************
      * Location Download
      ******************************
      
        01 Ams-Vendor.
           03 Brand               Pic x(3).
           03 Location-Number     Pic 9(4).
           03 Location-Type       Pic XX.
           03 Location-Name       Pic X(35).
           03 Address-1           Pic X(40).
           03 Address-2           Pic X(40).
           03 Address-3           Pic X(35).
           03 Postcode            Pic 9(4).
           03 Empty               pic X(6).
           03 State               Pic XXX.
           03 Location-Active     Pic X.