           01  UserTst1.
               05  Error-field-1              PIC +9(13).99.
               05  Field-1                    pic xxx.
               05  Num-2                      pic s9(4).  
               05  Error-field-2              PIC +9(13).99.
               05  Field-3                    pic xxx.
               05  Error-field-3              PIC +9(13).99.
               05  Field-4                    pic xxx.

