000900          03  KCODE-STORE-KEY.                                      
001000              05 KEYCODE-NO      PIC X(08).                         
001100              05 STORE-NO        PIC S9(03)   COMP-3.               
001200          03  THE-DATE           PIC S9(07)   COMP-3.               
001300          03  DEPT-NO            PIC S9(03)   COMP-3.               
001400          03  QTY-SOLD           PIC S9(9)    COMP-3.               
001500          03  SALE-PRICE         PIC S9(9)V99 COMP-3.               

