       01  Comp5Fields.
           03 NumA         pic --,---,---,---,---,--9.99.
           03 sep0         pic x.
           03 Num0         pic 99 comp-5.
           03 sep1         pic x.
           03 Num1         pic 9v99  comp-5.
           03 sep2         pic x.
           03 Num2         pic 9(02)v99 comp-5.
           03 sep3         pic x.
           03 Num3         pic 9(03)v99 comp-5.
           03 sep4         pic x.
           03 Num4         pic 9(04)v99 comp-5.
           03 sep5         pic x.
           03 Num5         pic 9(05)v99 comp-5.
           03 sep6         pic x.
           03 Num6         pic 9(06)v99 comp-5.
           03 sep7         pic x.
           03 Num7         pic 9(07)v99 comp-5.
           03 sep8         pic x.
           03 Num8         pic 9(08)v99 comp-5.
           03 sep9         pic x.
           03 Num9         pic 9(09)v99 comp-5.
           03 sep10        pic x.
           03 Num10        pic 9(10)v99 comp-5.
           03 sep11        pic x.
           03 Num11        pic 9(11)v99 comp-5.
           03 sep12        pic x.
           03 Num12        pic 9(12)v99 comp-5.
           03 sep13        pic x.
           03 Num13        pic 9(13)v99 comp-5.
           03 sep14        pic x.
           03 Num14        pic 9(14)v99 comp-5.
           03 sep15        pic x.
           03 Num15        pic 9(15)v99 comp-5.
           03 sep16        pic x.
           03 Num16        pic 9(16)v99 comp-5.
          
           03 sep17        pic x.
           03 Num17        pic 9(05)v99 comp-5.


