      ******************************************************************00010000
      *                                                                *00020000
      * DTAR192 -  Date Control Record                                 *00030000
      *                                                                *00040000
      * V01  B Martin  10/12/02 initial version                        *00050000
      *                                                                *00060000
      ******************************************************************00070000
      *                                                                 00080000
                                                                        00090000
                                                                        00100000
       03  DTAR192-Date-Control.                                        00110000
           05  DTAR192-Code            PIC 9(3) comp.                   00111000
           05  DTAR192-Date            PIC 9(6) comp-3.                 00120000
           05  DTAR192-Days            PIC 9(4) comp.                   00130000

