000100*                                                                         
000400*                                                                                                                          
000800*                                                                         
000900        03  DTAR021-KCODE-STORE-KEY.                                      
001000            05 DTAR021-KEYCODE-NO      PIC X(08).                         
001100            05 DTAR021-STORE-NO        PIC 9(03).               
001200        03  DTAR021-DATE               PIC 9(07).               
001300        03  DTAR021-DEPT-NO            PIC 9(03).               
001400        03  DTAR021-QTY-SOLD           PIC S9(9).               
001500        03  DTAR021-SALE-PRICE         PIC S9(9)V99.               

