      **   Copybook with a variable second part which can be defined 
      ** with seperate Cobol Copybook 
      ** -----------------------------------------------------------

         01  Detail-Record-A.
             05 Header-Details              Pic X(110).
             05 Variable-Part               Pic X(100).
