          
       01 date-tst.
          03 dd-mth-yyyy           pic x(12).
          03 yyyy-mm-dd            pic x(10).
          03 dd-mm-yyyy            pic x(10).
          03 dd-mm-yyyy-dot        pic x(10).
          03 cyymmdd               pic s9(7) comp-3.
          03 yymmdd                pic s9(7) comp-3.
          03 ddmmyy                pic s9(7) comp-3.
          03 yyyymmdd              pic s9(9) comp-3.

          