
       01  Numeric-Record.
           05  Numeric-comp-fld-2        PIC s99   comp.
           05  Numeric-comp-fld-4        PIC s9(4) comp.
           05  Numeric-comp-fld-5        PIC s9(5) comp.
           05  Numeric-comp-fld-6        PIC s9(6) comp.
           05  Numeric-comp-fld-8        PIC s9(8) comp.
           05  Numeric-comp-5-fld-2      PIC s99   comp-5.
           05  Numeric-comp-5-fld-4      PIC s9(4) comp-5.
           05  pcomp-fld-2               PIC 99    comp.
           05  pcomp-fld-4               PIC 9(4)  comp.
           05  pic9-fld-5                PIC s9(5).
