000900                                             
001000        05  DTAR023-KEYCODE-NO         PIC 9(08)    COMP-3.                         
001100        05  DTAR023-STORE-NO           PIC S9(03)   COMP-3.               
001200        03  DTAR023-DATE               PIC S9(08)   COMP-3.                             
001400        03  DTAR023-QTY-SOLD           PIC S9(9)    COMP.               
001500        03  DTAR023-SALE-PRICE         PIC S9(9)V99 COMP-3. 
              03  DTAR023-GST                PIC S9(9)V99 COMP-3.               

